Sales Analysis workbook by Paul Owe

This is a walkthrough of how I would use Pandas & Matplotlib to analyze and answer business questions about 12 months worth of sales data. The data contains hundreds of thousands of electronics store purchases broken down by month, product type, cost, purchase address, etc.

In [6]:
import pandas as pd
import os

# Task 1: Merging the 12 months of sales data into a single CSV file

In [4]:
df = pd.read_csv("./data/Sales_April_2019.csv") # data for April
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,176559,Bose SoundSport Headphones,1,99.99,2004-07-19 22:30,"682 Chestnut St, Boston, MA 02215"
2,176560,Google Phone,1,600,2004-12-19 14:38,"669 Spruce St, Los Angeles, CA 90001"
3,176560,Wired Headphones,1,11.99,2004-12-19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001"

In [10]:
# put all file objects in a list 

files = [file for file in os.listdir('./data')]

#concatenate all these files

all_months_data = pd.DataFrame() # empty df to hold your concatenated data

for file in files:
    df = pd.read_csv('./data/'+file)
    all_months_data = pd.concat([all_months_data, df])

all_months_data.to_csv('all_data.csv', index=False) # index false ignores that first column beside Orderid

In [33]:
all_data = pd.read_csv('all_data.csv')
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001"
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001"
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001"
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016"
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301"

## What was the best month for sales? How much was earned that month?

To answer this question we will need to 
- Multiply qty x price and
- group results by month

Approach is to create specific column for:
- Month, and 
- Sales

In [40]:
# Clean Data - Find all Nan in data set

nan_df = all_data[all_data.isna().any(axis=1)]
nan_df.head()

#Drop all NaN

all_data = all_data.dropna(how='all')

So, we see that our data was dirty because our concatenation process also added the column names over and over again. 
To remove these we can simply copy the filtering code and modify it a little bit

In [45]:
#index all_data[based on a condition]
all_data = all_data[all_data['Month'] != 'Or']
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001",12
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001",12
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001",12
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016",12
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301",12

In [46]:
# Month column
all_data['Month'] = all_data['Order Date'].str[0:2]
pd.to_numeric(all_data['Month'])
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001",12
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001",12
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001",12
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016",12
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301",12

In [49]:
# Step 1: Multiply qty by price

all_data['Quantity Ordered'] = pd.to_numeric(all_data['Quantity Ordered'])
all_data['Price Each'] = pd.to_numeric(all_data['Price Each'])

all_data['Sales'] = all_data['Quantity Ordered'] * all_data['Price Each']
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales
0,295665,Macbook Pro Laptop,1,1700.00,12/30/19 00:01,"136 Church St, New York City, NY 10001",12,1700.00
1,295666,LG Washing Machine,1,600.00,12/29/19 07:03,"562 2nd St, New York City, NY 10001",12,600.00
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001",12,11.95
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016",12,149.99
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301",12,11.95

Now, to answer this question, we will group by month and sum up the sales quantities

In [60]:
all_data.groupby('Month').sum()

       Quantity Ordered    Price Each         Sales
Month
01                10903  1.811768e+06  1.822257e+06
02                13449  2.188885e+06  2.202022e+06
03                17005  2.791208e+06  2.807100e+06
04                12356  2.056151e+06  2.071078e+06
05                18638  3.124570e+06  3.142047e+06
06                15253  2.562026e+06  2.577802e+06
07                16072  2.632540e+06  2.647776e+06
08                13448  2.230345e+06  2.244468e+06
09                13109  2.084992e+06  2.097560e+06
10                22703  3.715555e+06  3.736727e+06
11                19798  3.180601e+06  3.199603e+06
12                28114  4.588415e+06  4.613443e+06
20                 8231  1.322075e+06  1.330151e+06

In [59]:
wrong_month_data = all_data[all_data['Month'] == '20']

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales
25118,176559,Bose SoundSport Headphones,1,99.99,2004-07-19 22:30,"682 Chestnut St, Boston, MA 02215",20,99.99
25119,176560,Google Phone,1,600.00,2004-12-19 14:38,"669 Spruce St, Los Angeles, CA 90001",20,600.00
25120,176560,Wired Headphones,1,11.99,2004-12-19 14:38,"669 Spruce St, Los Angeles, CA 90001",20,11.99
25123,176563,Bose SoundSport Headphones,1,99.99,2004-02-19 7:46,"668 Center St, Seattle, WA 98101",20,99.99
25124,176564,USB-C Charging Cable,1,11.95,2004-12-19 10:58,"790 Ridge St, Atlanta, GA 30301",20,11.95
...,...,...,...,...,...,...,...,...
43481,194077,AA Batteries (4-pack),3,3.84,2004-11-19 9:46,"620 West St, Dallas, TX 75001",20,11.52
43484,194080,USB-C Charging Cable,2,11.95,2004-09-19 14:08,"517 Walnut St, Atlanta, GA 30301",20,23.90
43492,194088,AAA Batteries (4-pack),2,2.99,2004-04-19 18:46,"718 12th St, Austin, TX 73301",20,5.98
43493,194089,USB-C Charging Cable,1,11.95,2004-09-19 17:15,"458 11th St, San Francisco, CA 94016",20,11.95
43494,194090,Google Phone,1,600.00,2004-08-19 17:11,"177 Jackson St, Los Angeles, CA 90001",20,600.00

Looks like some of the dates were not formatted properly so we have a '20th month'
We will fix this below and rerun our groupby month and sum sales function again

In [ ]:
all_data